app/controllers/customers_controller.rb

SELECT  "customers".* FROM "customers" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    @customers = Customer.all.recent.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "customers" ("name", "address", "idcard", "mobile", "remark", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(customer_params)
    @customer.user = current_user
    if current_user.nil?
      redirect_to new_user_session_path
      return
    end
    if @customer.save

UPDATE "customers" SET "idcard" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["idcard", "4"], ["updated_at", "2019-12-30 10:21:17.954658"], ["id", 5]]
---
  def update
    if @customer.update(customer_params)

DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 1]]
---
  def destroy
    @customer&.destroy

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_customer
    @customer = Customer.find_by(id: params[:id])