app/controllers/stack_controller.rb

SELECT "customers".* FROM "customers"
---
  def show()

    params[:page] = 'index' unless params[:page]
    # FAKE PARAMS
    @customers = Customer.all unless params[:page] != 'customers'